toc_algebra_6_1 =   """
    
Делимость натуральных чисел ..... 4
Совместное выполнение действий с обыкновенными и десятичными дробями ..... 8
Нахождение процентов от данного числа.
Нахождение числа по его процентам ..... 12
Глава I. Отношения и пропорции
1.1. Отношение двух чисел ..... 16
1.2. Задачи на деление в данном отношении ..... 22
1.3. Процентное отношение двух чисел ..... 26
1.4. Пропорция. Основное свойство пропорции ..... 32
1.5. Прямо пропорциональная зависимость ..... 40
1.6. Обратно пропорциональная зависимость ..... 46
1.7. Решение задач на проценты способом пропорции ..... 53
1.8. Масштаб ..... 57
1.9. Длина окружности. Площадь круга. Шар. Сфера ..... 63
Упражнения для повторения к главе I ..... 69
Исторические сведения об отношениях и пропорциях ..... 71
Глава II. Рациональные числа и действия над ними
2.1. Положительные числа. Отрицательные числа ..... 72
2.2. Координатная прямая. Противоположные числа ..... 77
2.3. Целые числа. Рациональные числа. ..... 83
2.4. Модуль числа. ..... 89
2.5. Сравнение рациональных чисел ..... 97
2.6. Сложные задачи на движение по реке. (Для дополнительного изучения) ..... 105
Исторические сведения о системе счисления и отрицательных числах ..... 107
2.7. Сложение рациональных чисел с помощью координатной прямой ..... 110
2.8. Сложение отрицательных рациональных чисел ..... 117
2.9. Сложение рациональных чисел с разными знаками ..... 123
2.10. Свойства сложения рациональных чисел ..... 129
2.11. Вычитание рациональных чисел. Длина отрезка на координатной прямой ..... 133
2.12. Расстояние между точками координатной прямой ..... 140
2.13. Умножение рациональных чисел ..... 143
2.14. Переместительное и сочетательное свойства умножения рациональных чисел ..... 149
2.15. Деление рациональных чисел. ..... 153
2.16. Сложные задачи на проценты. (Для дополнительного изучения) ..... 158
Краткие исторические сведения о числе «нуль» ..... 163
2.17. Представление рационального числа в виде бесконечной десятичной периодической дроби ..... 164
2.18. Перевод бесконечной периодической десятичной дроби в обыкновенную дробь ..... 170
Арифметические действия над рациональными числами.
Упражнения для повторения к главе II. ..... 173
Глава III. Алгебраические выражения
3.1. Алгебраические выражения. Переменные. Алгебраическая сумма ..... 176
3.2. Раскрытие скобок. Коэффициент ..... 183
3.3. Подобные слагаемые. Приведение подобных слагаемых ..... 189
3.4. Тождества. Тождественные преобразования выражений ..... 195
Упражнения для повторения к главе III ..... 200
3.5. Многоэтажные дроби. (Для дополнительного изучения) ..... 202
    """